denjhang/STC_Chiptune/STC32G12K128/ay8910.c
/* ay8910.c - AY8910 仿真核心 (STC32G C251 版)
 * 从 STC8H C51 版移植, 去掉 xdata/code 关键字
 */
#include "STC32G.H"
#include "ay8910.h"
#include <string.h>

static u8  ay_reg[16];
static u16 ay_count[AY_CHANS];
static u8  ay_freq_lo[AY_CHANS];
static u8  ay_freq_hi[AY_CHANS];
static u8  ay_edge[AY_CHANS];
static u8  ay_tmask[AY_CHANS];
static u8  ay_nmask[AY_CHANS];
static u16 ay_env_freq;
static u32 ay_env_count;
static u8  ay_env_step;
static u8  ay_env_attack;
static u8  ay_env_continue, ay_env_alternate, ay_env_hold, ay_env_pause;
static u32 ay_noise_seed;
static u8  ay_noise_scaler;
static u8  ay_noise_count;
static u8  ay_noise_freq;
static u8  ay_volume[AY_CHANS];
static u32 ay_base_count;

static const u8 ay_voltbl[32] = {
    0x00, 0x00, 0x03, 0x03, 0x04, 0x04, 0x06, 0x06,
    0x09, 0x09, 0x0D, 0x0D, 0x12, 0x12, 0x1D, 0x1D,
    0x22, 0x22, 0x37, 0x37, 0x4D, 0x4D, 0x62, 0x62,
    0x82, 0x82, 0xA6, 0xA6, 0xD0, 0xD0, 0xFF, 0xFF
};

static const u8 ay_regmsk[16] = {
    0xff, 0x0f, 0xff, 0x0f, 0xff, 0x0f, 0x1f, 0x3f,
    0x1f, 0x1f, 0x1f, 0xff, 0xff, 0x0f, 0xff, 0xff
};

void ay_init(void) {
    memset(ay_reg, 0, sizeof(ay_reg));
    memset(ay_count, 0, sizeof(ay_count));
    memset(ay_freq_lo, 0, sizeof(ay_freq_lo));
    memset(ay_freq_hi, 0, sizeof(ay_freq_hi));
    memset(ay_edge, 0, sizeof(ay_edge));
    memset(ay_tmask, 0, sizeof(ay_tmask));
    memset(ay_nmask, 0, sizeof(ay_nmask));
    memset(ay_volume, 0, sizeof(ay_volume));
    ay_env_freq = 0;
    ay_env_count = 0;
    ay_env_step = 0;
    ay_env_attack = 0;
    ay_env_continue = 0;
    ay_env_alternate = 0;
    ay_env_hold = 0;
    ay_env_pause = 0;
    ay_noise_seed = 1;
    ay_noise_scaler = 0;
    ay_noise_count = 0;
    ay_noise_freq = 0;
    ay_base_count = 0;
}

void ay_wr(u8 reg, u8 val) {
    u8 c;
    u16 freq;

    if (reg > 15) return;
    val &= ay_regmsk[reg];
    ay_reg[reg] = val;

    switch (reg) {
    case 0: case 2: case 4:
    case 1: case 3: case 5:
        c = reg >> 1;
        freq = ((u16)ay_reg[c * 2 + 1] & 0x0F) << 8;
        freq |= ay_reg[c * 2];
        ay_freq_lo[c] = ay_reg[c * 2];
        ay_freq_hi[c] = ay_reg[c * 2 + 1] & 0x0F;
        break;
    case 6:
        ay_noise_freq = val & 31;
        break;
    case 7:
        ay_tmask[0] = (val & 1) ? 1 : 0;
        ay_tmask[1] = (val & 2) ? 1 : 0;
        ay_tmask[2] = (val & 4) ? 1 : 0;
        ay_nmask[0] = (val & 8) ? 1 : 0;
        ay_nmask[1] = (val & 16) ? 1 : 0;
        ay_nmask[2] = (val & 32) ? 1 : 0;
        break;
    case 8: case 9: case 10:
        ay_volume[reg - 8] = val;
        break;
    case 11: case 12:
        ay_env_freq = ((u16)ay_reg[12] << 8) + ay_reg[11];
        break;
    case 13:
        ay_env_continue = (val >> 3) & 1;
        ay_env_attack   = (val >> 2) & 1;
        ay_env_alternate= (val >> 1) & 1;
        ay_env_hold     = val & 1;
        ay_env_pause    = 0;
        ay_env_step     = ay_env_attack ? 0 : 0x0F;
        break;
    }
}

s16 ay_render(void) {
    u8 i, incr, noise;
    u16 freq;
    u16 ch_out;
    s16 mix;
    u8 vol_idx, vol_val;

    ay_base_count += AY_BASE_INCR;
    incr = (u8)(ay_base_count >> AY_GETA_BITS);
    ay_base_count &= (1UL << AY_GETA_BITS) - 1;

    if (incr > 0) {
        ay_env_count += incr;
        if (ay_env_freq > 0 && ay_env_count >= ay_env_freq) {
            if (!ay_env_pause) {
                ay_env_step--;
            }
            if (ay_env_step == 0xFF) {
                if (ay_env_hold) {
                    if (ay_env_alternate) ay_env_attack ^= 0x0F;
                    ay_env_pause = 1;
                    ay_env_step = 0;
                } else {
                    if (ay_env_alternate && ay_env_step & 0x10)
                        ay_env_attack ^= 0x0F;
                    ay_env_step = 0x0F;
                }
            }
            if (ay_env_freq >= incr)
                ay_env_count -= ay_env_freq;
            else
                ay_env_count = 0;
        }

        ay_noise_count += incr;
        if (ay_noise_freq > 0 && ay_noise_count >= ay_noise_freq) {
            ay_noise_scaler ^= 1;
            if (ay_noise_scaler) {
                if (ay_noise_seed & 1)
                    ay_noise_seed ^= 0x24000;
                ay_noise_seed >>= 1;
            }
            if (ay_noise_freq >= incr)
                ay_noise_count -= ay_noise_freq;
            else
                ay_noise_count = 0;
        }
    }
    noise = ay_noise_seed & 1;

    mix = 0;
    for (i = 0; i < AY_CHANS; i++) {
        if (incr > 0) {
            freq = ((u16)ay_freq_hi[i] << 8) | ay_freq_lo[i];
            ay_count[i] += incr;
            if (freq > 0 && ay_count[i] >= freq) {
                ay_edge[i] = !ay_edge[i];
                if (freq >= incr)
                    ay_count[i] -= freq;
                else
                    ay_count[i] = 0;
            }
        }

        ch_out = 0;
        if ((ay_tmask[i] || ay_edge[i]) && (ay_nmask[i] || noise)) {
            vol_idx = ay_volume[i] & 0x0F;
            if (ay_volume[i] & 0x10)
                vol_idx = ay_env_step ^ ay_env_attack;
            vol_val = ay_voltbl[vol_idx];
            ch_out = (u16)vol_val << 4;
        }
        mix += (s16)((u16)ch_out >> 4) - 8;
    }
    return mix;
}
